; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-7-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p2-1 - location
	p2-3 - location
	p2-4 - location
	p3-0 - location
	p3-1 - location
	p3-2 - location
	p4-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s4)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at package1 s1)
	(at package2 s4)
	(at package3 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 59)
	(= (time-to-walk p0-1 s0) 59)
	(= (time-to-walk s1 p0-1) 25)
	(= (time-to-walk p0-1 s1) 25)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 81)
	(= (time-to-walk p2-1 s2) 81)
	(= (time-to-walk s1 p2-1) 41)
	(= (time-to-walk p2-1 s1) 41)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 77)
	(= (time-to-walk p2-3 s2) 77)
	(= (time-to-walk s3 p2-3) 76)
	(= (time-to-walk p2-3 s3) 76)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 1)
	(= (time-to-walk p2-4 s2) 1)
	(= (time-to-walk s4 p2-4) 42)
	(= (time-to-walk p2-4 s4) 42)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 24)
	(= (time-to-walk p3-0 s3) 24)
	(= (time-to-walk s0 p3-0) 83)
	(= (time-to-walk p3-0 s0) 83)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 41)
	(= (time-to-walk p3-1 s3) 41)
	(= (time-to-walk s1 p3-1) 3)
	(= (time-to-walk p3-1 s1) 3)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 60)
	(= (time-to-walk p4-3 s4) 60)
	(= (time-to-walk s3 p4-3) 20)
	(= (time-to-walk p4-3 s3) 20)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 83)
	(= (time-to-drive s1 s0) 83)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 61)
	(= (time-to-drive s4 s0) 61)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 46)
	(= (time-to-drive s4 s1) 46)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 21)
	(= (time-to-drive s0 s2) 21)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 32)
	(= (time-to-drive s3 s2) 32)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 19)
	(= (time-to-drive s4 s2) 19)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 48)
	(= (time-to-drive s0 s3) 48)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 42)
	(= (time-to-drive s1 s3) 42)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s0)
	(at truck1 s1)
	(at truck2 s4)
	(at truck3 s2)
	(at truck4 s3)
	(at truck6 s1)
	(at package1 s2)
	(at package2 s2)
	(at package3 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver2 s1 p2-1)
   deleted: (at driver2 s1)
   added: (at driver2 p2-1)
   changed: (walked) from 0 to 41
   goals met: 1 of 12
2. (board-truck driver4 truck4 s4)
   deleted: (at driver4 s4) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 1 of 12
3. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 12
4. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 1 of 12
5. (drive-truck truck4 s4 s0 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (driven) from 0 to 61
   goals met: 1 of 12
6. (walk driver2 p2-1 s2)
   deleted: (at driver2 p2-1)
   added: (at driver2 s2)
   changed: (walked) from 41 to 122
   goals met: 2 of 12
7. (walk driver3 s0 p3-0)
   deleted: (at driver3 s0)
   added: (at driver3 p3-0)
   changed: (walked) from 122 to 205
   goals met: 2 of 12
8. (walk driver3 p3-0 s3)
   deleted: (at driver3 p3-0)
   added: (at driver3 s3)
   changed: (walked) from 205 to 229
   goals met: 3 of 12
9. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 4 of 12
10. (load-truck package3 truck3 s3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 4 of 12
11. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 12
12. (drive-truck truck1 s4 s1 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 61 to 107
   goals met: 4 of 12
13. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 5 of 12
14. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 5 of 12
15. (drive-truck truck3 s3 s1 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 107 to 149
   goals met: 5 of 12
16. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   goals met: 6 of 12
17. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 6 of 12
18. (drive-truck truck3 s1 s3 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 149 to 191
   goals met: 6 of 12
19. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 12
20. (drive-truck truck2 s2 s4 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (driven) from 191 to 210
   goals met: 6 of 12
21. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 210 to 242
   goals met: 7 of 12
22. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 8 of 12
23. (drive-truck truck2 s4 s2 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (driven) from 242 to 261
   goals met: 7 of 12
24. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 261 to 293
   goals met: 7 of 12
25. (drive-truck truck3 s2 s3 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 293 to 325
   goals met: 6 of 12
26. (drive-truck truck3 s3 s1 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 325 to 367
   goals met: 6 of 12
27. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   goals met: 6 of 12
28. (drive-truck truck3 s1 s3 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 367 to 409
   goals met: 6 of 12
29. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (driven) from 409 to 451
   goals met: 6 of 12
30. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 6 of 12
31. (walk driver2 s1 p2-1)
   deleted: (at driver2 s1)
   added: (at driver2 p2-1)
   changed: (walked) from 229 to 270
   goals met: 6 of 12
32. (walk driver2 p2-1 s2)
   deleted: (at driver2 p2-1)
   added: (at driver2 s2)
   changed: (walked) from 270 to 351
   goals met: 7 of 12
33. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 8 of 12
34. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 7 of 12
35. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 7 of 12
36. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 12
37. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 7 of 12
38. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 451 to 497
   goals met: 8 of 12
39. (board-truck driver3 truck7 s3)
   deleted: (at driver3 s3) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 7 of 12
40. (load-truck package1 truck7 s3)
   deleted: (at package1 s3)
   added: (in package1 truck7)
   goals met: 7 of 12
41. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 497 to 543
   goals met: 6 of 12
42. (drive-truck truck7 s3 s2 driver3)
   deleted: (at truck7 s3)
   added: (at truck7 s2)
   changed: (driven) from 543 to 575
   goals met: 6 of 12
43. (unload-truck package1 truck7 s2)
   deleted: (in package1 truck7)
   added: (at package1 s2)
   goals met: 7 of 12
44. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 575 to 621
   goals met: 8 of 12
45. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 7 of 12
46. (drive-truck truck4 s0 s3 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (driven) from 621 to 669
   goals met: 8 of 12
47. (disembark-truck driver4 truck4 s3)
   deleted: (driving driver4 truck4)
   added: (at driver4 s3) (empty truck4)
   goals met: 8 of 12
48. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 669 to 715
   goals met: 7 of 12
49. (walk driver4 s3 p3-0)
   deleted: (at driver4 s3)
   added: (at driver4 p3-0)
   changed: (walked) from 351 to 375
   goals met: 7 of 12
50. (walk driver4 p3-0 s0)
   deleted: (at driver4 p3-0)
   added: (at driver4 s0)
   changed: (walked) from 375 to 458
   goals met: 8 of 12
51. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (driven) from 715 to 757
   goals met: 8 of 12
52. (drive-truck truck7 s2 s3 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   changed: (driven) from 757 to 789
   goals met: 8 of 12
53. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 8 of 12
54. (disembark-truck driver3 truck7 s3)
   deleted: (driving driver3 truck7)
   added: (at driver3 s3) (empty truck7)
   goals met: 9 of 12
55. (walk driver1 s3 p3-1)
   deleted: (at driver1 s3)
   added: (at driver1 p3-1)
   changed: (walked) from 458 to 499
   goals met: 9 of 12
56. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 12
57. (walk driver1 p3-1 s3)
   deleted: (at driver1 p3-1)
   added: (at driver1 s3)
   changed: (walked) from 499 to 540
   goals met: 8 of 12
58. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 8 of 12
59. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 789 to 821
   goals met: 9 of 12
60. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 10 of 12
61. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 10 of 12
62. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   changed: (walked) from 540 to 621
   goals met: 10 of 12
63. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 9 of 12
64. (drive-truck truck2 s3 s1 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (driven) from 821 to 863
   goals met: 9 of 12
65. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 863 to 909
   goals met: 10 of 12
66. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 10 of 12
67. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   changed: (walked) from 621 to 662
   goals met: 11 of 12
68. (walk driver3 s4 p4-3)
   deleted: (at driver3 s4)
   added: (at driver3 p4-3)
   changed: (walked) from 662 to 722
   goals met: 11 of 12
69. (walk driver3 p4-3 s3)
   deleted: (at driver3 p4-3)
   added: (at driver3 s3)
   changed: (walked) from 722 to 742
   goals met: 12 of 12
